[
    { "name" : "Battle Strike", "desc" : "Increases attack and damage for next attack.", "type" : ["na"] },
    { "name" : "Dark Rage", "desc" : "Increases Melee attack and damage for 1 turn.", "type" : ["Dark Side"] },
    { "name" : "Farseeing", "desc" : "You use The Force to detect an individual over a long distance.", "type" : ["na"] },
    { "name" : "Force Disarm", "desc" : "Disarms an opponent using The Force.", "type" : ["Telekinetic"] },
    { "name" : "Force Grip", "desc" : "Chokes or crushes an opponent, may force opponent to lose their Standard Action.", "type" : ["Telekinetic"] },
    { "name" : "Force Lightning", "desc" : "Electrocutes an opponent, deals automatic damage.", "type" : ["Dark Side"] },
    { "name" : "Force Slam", "desc" : "Pounds multiple opponents, and may knock them Prone.", "type" : ["Telekinetic"] },
    { "name" : "Force Stun", "desc" : "Stuns an opponent, and damages their overall Condition.", "type" : ["na"] },
    { "name" : "Force Thrust", "desc" : "You use The Force to push back an opponent several meters, and possibly deal damage.", "type" : ["Telekinetic"] },
    { "name" : "Mind Trick", "desc" : "You influence the mind of a target by dominating their will.", "type" : ["Mind-Affecting"] },
    { "name" : "Move Object", "desc" : "You use The Force to hold, move, or crush one target.", "type" : ["Telekinetic"] },
    { "name" : "Negate Energy", "desc" : "You dissipate an energy attack.", "type" : ["na"] },
    { "name" : "Rebuke", "desc" : "You deflect a Force Power used against you.", "type" : ["na"] },
    { "name" : "Sever Force", "desc" : "You temporarily block a Force-User's access to The Force.", "type" : ["Light Side"] },
    { "name" : "Surge", "desc" : "You use The Force to assist in a supernatural Jump.", "type" : ["na"] },
    { "name" : "Vital Transfer", "desc" : "You heal another through The Force.", "type" : ["Light Side"] },
    { "name" : "Energy Resistance", "desc" : "You use The Force to protect you from damage caused by energy, sonic, fire, cold, and electrical sources.", "type" : ["na"] },
    { "name" : "Fear", "desc" : "You summon The Dark Side to instill fear in your enemies.", "type" : ["Dark Side","Mind-Affecting"] },
    { "name" : "Force Scream", "desc" : "You create an intense sonic scream, amplified by The Force.", "type" : ["Dark Side"] },
    { "name" : "Force Whirlwind", "desc" : "You call upon The Force to surround an enemy in a swirling vortex of Force energy. The whirlwind lifts them about half a meter off the ground, spinning them in the air and buffeting them with Force energy.", "type" : ["Telekinetic"] },
    { "name" : "Ionize", "desc" : "You call upon The Force to overload electrical systems and Droids, damaging or even destroying the unit.", "type" : ["na"] },
    { "name" : "Kinetic Combat", "desc" : "You use The Force to manipulate your chosen weapon, allowing it to operate independent of your grasp.", "type" : ["Telekinetic"] },
    { "name" : "Resist Force", "desc" : "You use The Force to protect yourself from an opponent's Force Powers.", "type" : ["na"] },
    { "name" : "Slow", "desc" : "The Force enables you to slow your targets as if they are encumbered by an extremely Heavy Load, making it difficult for them to move.", "type" : ["Telekinetic"] },
    { "name" : "Valor", "desc" : "You call upon the strength of The Force, reaching out to your ally and sharing your strength with them.", "type" : ["Light Side"] },
    { "name" : "Wound", "desc" : "You cause spasms in the lungs of your targets, painfully injuring them.", "type" : ["Dark Side"] },
    { "name" : "Corruption", "desc" : "You use The Force to send a bolt of pure Dark Side vileness into an enemy.", "type" : ["Dark Side"] },
    { "name" : "Force Blast", "desc" : "You use The Force to create a ball of compressed air and debris that you can hurl at enemy targets.", "type" : ["na"] },
    { "name" : "Force Shield", "desc" : "You use The Force to create a bubble of telekinetic energy around yourself, protecting you from harm.", "type" : ["Telekinetic"] },
    { "name" : "Force Storm", "desc" : "You use The Force to create a swirling whirlwind of dark energy around yourself.", "type" : ["Dark Side","Telekinetic"] },
    { "name" : "Repulse", "desc" : "You use The Force to clear an area around yourself.", "type" : ["Telekinetic"] },
    { "name" : "Cloak", "desc" : "You bend light around your body, rendering yourself invisible to anyone looking in your direction.", "type" : ["na"] },
    { "name" : "Levitate", "desc" : "You can float up or down without anything or anyone to assist you.", "type" : ["Telekinetic"] },
    { "name" : "Malacia", "desc" : "You create dizziness and nausea by disrupting your target's equilibrium.", "type" : ["Light Side"] },
    { "name" : "Morichro", "desc" : "You slow the vital functions of a target, causing them to slip into a deep sleep or even die.", "type" : ["na"] },
    { "name" : "Phase", "desc" : "You can pass through solid objects, such as walls and doors.", "type" : ["na"] },
    { "name" : "Rend", "desc" : "You can move a single target, whether it is a creature or object, in two different directions simultaneously.", "type" : ["Dark Side"] },
    { "name" : "Shatterpoint", "desc" : "You can see the critical point of something, whether it is a person or object, that would shatter if struck at the right time.", "type" : ["na"] },
    { "name" : "Technometry", "desc" : "You can tap into and read technological devices and, in some cases, control them.", "type" : ["na"] },
    { "name" : "Ballistakinesis", "desc" : "You use The Force to spray an area with dangerous debris.", "type" : ["Telekinetic"] },
    { "name" : "Combustion", "desc" : "You use The Force to agitate particles in the air to create a pyrokinetic spray of sparks.", "type" : ["na"] },
    { "name" : "Dark Transfer", "desc" : "You use the Dark Side of The Force to restore vitality to a living being.", "type" : ["Dark Side"] },
    { "name" : "Detonate", "desc" : "You can perceive points of weakness within an object and use The Force to telekinetically press on one of those points, shattering the object.", "type" : ["Telekinetic"] },
    { "name" : "Enlighten", "desc" : "You reach out to an ally telepathically, sharing visions of the near future to give the ally an edge or to protect the ally from harm.", "type" : ["Light Side","Mind-Affecting"] },
    { "name" : "Lightning Burst", "desc" : "You call upon the Dark Side to cause lightning to arc out from your body, striking adjacent enemies.", "type" : ["Dark Side"] },
    { "name" : "Obscure", "desc" : "You use The Force to cloud an enemy's mind, making it harder for the enemy to see its target.", "type" : ["Mind-Affecting"] },
    { "name" : "Prescience", "desc" : "The Force grants you a flash of insight in dealing with your enemies.", "type" : ["na"] },
    { "name" : "Stagger", "desc" : "You use The Force to lash out at a nearby enemy, causing it to stumble.", "type" : ["Telekinetic"] },
    { "name" : "Blind", "desc" : "You hurl dirt, dust, and debris at your foe, affecting its sight.", "type" : ["Telekinetic"] },
    { "name" : "Convection", "desc" : "You alter your body chemistry, causing your skin to burn with incredible heat.", "type" : ["na"] },
    { "name" : "Crucitorn", "desc" : "You ignore the debilitating effects of physical pain, and focus despite great physical trauma.", "type" : ["na"] },
    { "name" : "Cryokinesis", "desc" : "You can use The Force to draw heat away from a target, causing its temperature to drop rapidly.", "type" : ["na"] },
    { "name" : "Drain Energy", "desc" : "You can draw the energy out of a powered object, such as a blaster's Power Pack or a Power Generator.", "type" : ["na"] },
    { "name" : "Fold Space", "desc" : "You can use The Force to bend space, transporting an object almost instantaneously from one place to another.", "type" : ["na"] },
    { "name" : "Force Light", "desc" : "You can draw The Force into yourself, turning you into a beacon of light that purges the taint of the Dark Side.", "type" : ["Light Side"] },
    { "name" : "Force Storm", "desc" : "You can create a storm that draws upon the Dark Side of The Force, focusing its malicious intent on a certain area.", "type" : ["Dark Side"] },
    { "name" : "Force Track", "desc" : "You peer into The Force for guidance, picking up the trail of your quarry.", "type" : ["na"] },
    { "name" : "Hatred", "desc" : "You give yourself over to the Dark Side, letting your hate radiate out from your body in palpable waves.", "type" : ["Dark Side"] },
    { "name" : "Inertia", "desc" : "You can use The Force to shift your body's inertia, allowing you to perform impossible stunts.", "type" : ["na"] },
    { "name" : "Inspire", "desc" : "You fill your allies with hope and courage, allowing them to face even the most daunting of odds.", "type" : ["Light Side"] },
    { "name" : "Intercept", "desc" : "You use The Force to telekinetically hurl a small object in the path of an incoming projectile, preventing it from striking you.", "type" : ["Telekinetic"] },
    { "name" : "Memory Walk", "desc" : "You torment an enemy by causing them to relive their most horrible memories.", "type" : ["Dark Side","Mind-Affecting"] },
    { "name" : "Mind Shard", "desc" : "You use The Force to splinter the mind of an opponent, wracking it with pain.", "type" : ["Mind-Affecting"] },
    { "name" : "Plant Surge", "desc" : "You reach out with The Force to entreat the aid of plants, causing them to lash out at your opponents.", "type" : ["na"] },
    { "name" : "Thought Bomb", "desc" : "You use The Force to radiate out harmful waves of telepathy, damaging the minds of nearby foes.", "type" : ["Mind-Affecting"] }    
]
    