[
    {"name" : "Assured Strike", "desc" : "You trade power for accuracy.","type" : ["na"]},
    { "name" : "Barrier of Blades", "desc" : "You whip your Lightsaber around you, creating a barrier through which blaster fire rarely penetrates.","type" : ["na"]},
    { "name" : "Circle of Shelter", "desc" : "You create a protected area around yourself, through which enemies have difficulty reaching you or your allies.","type" : ["na"]},
    { "name" : "Contentious Opportunity",  "desc" : "You seize the moment when your opponent gives you an opening, darting in to strike.","type" : ["na"]},
    { "name" : "Deflecting Slash",  "desc" : "You use the momentum from your effort to deflect a projectile to strike at an adjacent opponent.","type" : ["na"]},
    { "name" : "Disarming Slash",  "desc" : "You strike at your opponent's weapon, attempting to rip it from their grasp.","type" : ["na"]},
    { "name" : "Draw Closer",  "desc" : "You grab an opponent with The Force, drawing him or her into the path of your weapon.","type" : ["Telekinetic"]},
    { "name" : "Falling Avalanche",  "desc" : "You raise your Lightsaber above your head and then bring it crashing down on your opponent with incredible force.","type" : ["na"]},
    { "name" : "Fluid Riposte",  "desc" : "You smoothly turn aside an opponent's melee attack, stepping in to deliver your own attack.","type" : ["na"]},
    { "name" : "Hawk-Bat Swoop",  "desc" : "You leap into action against your foe, striking with your Lightsaber before other enemies have a chance to react.","type" : ["na"]},
    { "name" : "High Ground Defense",  "desc" : "You know how to take advantage of the terrain and gain a defensive advantage from it.","type" : ["na"]},
    { "name" : "Makashi Riposte",  "desc" : "You are trained in a Makashi technique that allows you to slightly change the angle of an opponent's attack before striking with a decisive riposte of your own.","type" : ["na"]},
    { "name" : "Pass the Blade",  "desc" : "You deactivate your Lightsaber as your opponent attempts to block it, reactivating it just after it passes by their blade.","type" : ["na"]},
     { "name" : "Pushing Slash",  "desc" : "You strike at your target with your Lightsaber, then hurl them away from you with The Force.","type" : ["Telekinetic"]},
     { "name" : "Rising Whirlwind",  "desc" : "You swing your Lightsabers around your body, creating a brilliant whirlwind of deadly light.","type" : ["na"]},
    { "name" : "Saber Swarm",  "desc" : "You slash at your opponent rapidly, aiming many short strikes at the target's body.","type" : ["na"]},
     { "name" : "Sarlacc Sweep",  "desc" : "You lash out at multiple enemies, striking them with a sweeping motion.","type" : ["na"]},
     { "name" : "Shien Deflection",  "desc" : "You deflect an incoming attack and leap toward your attacker with fierce abandon.","type" : ["na"]},
    { "name" : "Swift Flank",  "desc" : "You leap over or dash around your opponent, striking before they have time to react.","type" : ["na"]},
     { "name" : "Tempered Aggression",  "desc" : "You throw yourself against an opponent, controlling your aggression to prevent it from getting the better of you.","type" : ["Dark Side"]},
     { "name" : "Twin Strike",  "desc" : "You swing both of your Lightsabers in an arc toward the target, slamming them home with great force.","type" : ["na"]},
    { "name" : "Unbalancing Block",  "desc" : "You catch an opponent's weapon on your blade before deactivating your blade momentarily, causing them to stumble.","type" : ["na"]},
     { "name" : "Unhindered Charge",  "desc" : "You move quickly to your opponent, ignoring Difficult Terrain and obstacles.","type" : ["na"]},
     { "name" : "Vornskr's Ferocity",  "desc" : "You walk the thin line between darkness and light as you ferociously attack your foe.","type" : ["Dark Side"]}
  ]